# TopRail Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Railing..::..TopRail Property
Railing Class See Also
---
The top rail of the railing.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId TopRail { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TopRail As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ TopRail {
	ElementId^ get ();
}
```

# See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace